nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_bms_demo.c
  fd = open("/dev/adc0", O_RDONLY);
  if (fd < 0)
    {
      aerr("ERROR: Failed to open ADC device: %d\n", errno);
      return -errno;
    }

  /* Setup channel list in buffer */

  memcpy(g_channel_buffer, channels, count);

  /* Trigger batch conversion */

  ret = ioctl(fd, ANIOC_TRIGGER, 0);
  if (ret < 0)
    {
      aerr("ERROR: Failed to trigger batch ADC conversion: %d\n", errno);
      close(fd);
      return -errno;
    }

  /* Read batch data - this would be implementation specific for DTC */

  /* For now, fall back to individual reads */

  for (size_t i = 0; i < count; i++)
    {
      ret = ra8e1_adc_read_channel(channels[i], &values[i]);
      if (ret < 0)
        {
          aerr("ERROR: Failed to read channel %d in batch: %d\n", channels[i], ret);
          close(fd);
          return ret;
        }
    }

  close(fd);
  return OK;
}

/****************************************************************************
 * Name: ra8e1_adc_read_battery_data_dtc
 *
 * Description:
 *   Read battery data using DTC for efficient multi-channel sampling
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int ra8e1_adc_read_battery_data_dtc(void)
{
  uint8_t channels[2] = {ADC_BATTERY_VOLTAGE_CHANNEL, ADC_BATTERY_CURRENT_CHANNEL};
  uint32_t values[2];
  int ret;

  /* Read both channels simultaneously using DTC */

  ret = ra8e1_adc_read_batch_dtc(channels, values, 2);
  if (ret < 0)
    {
      aerr("ERROR: Failed to read battery data with DTC: %d\n", ret);
      return ret;
    }

  /* Convert raw values to actual measurements */

  g_battery_status.voltage_mv = ra8e1_adc_convert_voltage(values[0]);
  g_battery_status.current_ma = ra8e1_adc_convert_current(values[1]);
  g_battery_status.percentage = ra8e1_calculate_battery_percentage(g_battery_status.voltage_mv);

  /* Calculate power consumption */

  g_battery_status.power_mw = (g_battery_status.voltage_mv * abs(g_battery_status.current_ma)) / 1000;

  /* Determine charging status */

  g_battery_status.is_charging = (g_battery_status.current_ma > 50);
  g_battery_status.is_valid = true;

  ainfo("Battery Status (DTC): %lu mV, %ld mA, %lu mW, %d%%, %s\n",
        g_battery_status.voltage_mv, g_battery_status.current_ma,
        g_battery_status.power_mw, g_battery_status.percentage,
        g_battery_status.is_charging ? "Charging" : "Discharging");

  return OK;
}
#endif /* CONFIG_RA_ADC_DTC */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_adc_initialize
 *
 * Description:
 *   Initialize ADC subsystem for battery monitoring on FPB-RA8E1
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

void ra8e1_adc_initialize(void)
{
  int ret;

  if (g_adc_initialized)
    {
      ainfo("ADC already initialized\n");
      return;
    }

  ainfo("Initializing FPB-RA8E1 ADC for battery monitoring\n");

  /* Setup ADC hardware and drivers */

  ret = ra8e1_adc_setup();
  if (ret < 0)
    {
      aerr("ERROR: ADC setup failed: %d\n", ret);
      return;
    }

  /* Initialize battery status structure */

  memset(&g_battery_status, 0, sizeof(g_battery_status));

  /* Perform initial battery reading */

#ifdef CONFIG_RA_ADC_DTC
  ret = ra8e1_adc_read_battery_data_dtc();
#else
  ret = ra8e1_adc_read_battery_data();
#endif

  if (ret < 0)
    {
      awarn("WARNING: Initial battery reading failed: %d\n", ret);
    }

  g_adc_initialized = true;
  ainfo("FPB-RA8E1 ADC initialization complete\n");
}

/****************************************************************************
 * Name: ra8e1_read_battery_voltage
 *
 * Description:
 *   Read battery voltage in millivolts
 *
 * Input Parameters:
 *   voltage_mv - Pointer to store voltage value
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

int ra8e1_read_battery_voltage(uint32_t *voltage_mv)
{
  uint32_t raw_value;
  int ret;

  if (!g_adc_initialized)
    {
      aerr("ERROR: ADC not initialized\n");
      return -ENODEV;
    }

  if (voltage_mv == NULL)
    {
      return -EINVAL;
    }

  ret = ra8e1_adc_read_channel(ADC_BATTERY_VOLTAGE_CHANNEL, &raw_value);
  if (ret < 0)
    {
      return ret;
    }

  *voltage_mv = ra8e1_adc_convert_voltage(raw_value);
  return OK;
}

/****************************************************************************
 * Name: ra8e1_read_battery_current
 *
 * Description:
 *   Read battery current in milliamps
 *
 * Input Parameters:
 *   current_ma - Pointer to store current value
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

int ra8e1_read_battery_current(int32_t *current_ma)
{
  uint32_t raw_value;
  int ret;

  if (!g_adc_initialized)
    {
      aerr("ERROR: ADC not initialized\n");
      return -ENODEV;
    }

  if (current_ma == NULL)
    {
      return -EINVAL;
    }

  ret = ra8e1_adc_read_channel(ADC_BATTERY_CURRENT_CHANNEL, &raw_value);
  if (ret < 0)
    {
      return ret;
    }

  *current_ma = ra8e1_adc_convert_current(raw_value);
  return OK;
}

/****************************************************************************
 * Name: ra8e1_get_battery_status
 *
 * Description:
 *   Get complete battery status information
 *
 * Input Parameters:
 *   status - Pointer to store battery status
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

