nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_bms_demo.c
          case 'c':
            sample_count = atoi(optarg);
            if (sample_count <= 0)
              {
                fdemoprintf(stderr, "Error: Sample count must be positive\n");
                show_usage(argv[0], EXIT_FAILURE);
              }
            break;

          case 'd':
            delay_ms = atoi(optarg);
            if (delay_ms < 0)
              {
                fdemoprintf(stderr, "Error: Delay must be non-negative\n");
                show_usage(argv[0], EXIT_FAILURE);
              }
            break;

          case 'v':
            verbose = true;
            break;

          case 's':
            single_mode = true;
            break;

          case 'm':
            continuous_mode = true;
            break;

          case '?':
          default:
            fdemoprintf(stderr, "Error: Unknown option\n");
            show_usage(argv[0], EXIT_FAILURE);
            break;
        }
    }

  /* Validate mode combinations */

  if (single_mode && continuous_mode)
    {
      fdemoprintf(stderr, "Error: Cannot use both single and continuous mode\n");
      show_usage(argv[0], EXIT_FAILURE);
    }

  demoprintf("FPB-RA8E1 ADC Battery Monitor\n");
  demoprintf("=====================================\n");

  /* Initialize ADC */

  ra8e1_adc_initialize();

  if (single_mode)
    {
      /* Single sample mode */

      demoprintf("Taking single battery measurement...\n");
      ret = ra8e1_get_battery_status(&status);
      if (ret < 0)
        {
          fdemoprintf(stderr, "Error: Failed to read battery status: %d\n", ret);
          return EXIT_FAILURE;
        }

      print_battery_status(&status, true);  /* Always verbose for single mode */
    }
  else if (continuous_mode)
    {
      /* Continuous monitoring mode */

      demoprintf("Continuous monitoring mode (Ctrl+C to stop)\n");
      if (!verbose)
        {
          demoprintf("Format: Voltage | Current | Power | Charge | Status\n");
          demoprintf("--------|--------|-------|-------|--------\n");
        }

      i = 0;
      while (true)
        {
          ret = ra8e1_get_battery_status(&status);
          if (ret < 0)
            {
              fdemoprintf(stderr, "Error: Failed to read battery status: %d\n", ret);
              usleep(delay_ms * 1000);
              continue;
            }

          if (verbose)
            {
              demoprintf("\n--- Sample %d ---\n", ++i);
            }
          else
            {
              demoprintf("%3d: ", ++i);
            }

          print_battery_status(&status, verbose);

          usleep(delay_ms * 1000);
        }
    }
  else
    {
      /* Multiple sample mode */

      demoprintf("Taking %d battery measurements with %dms delay...\n", 
             sample_count, delay_ms);

      if (!verbose)
        {
          demoprintf("Sample | Voltage | Current | Power | Charge | Status\n");
          demoprintf("-------|---------|---------|-------|--------|--------\n");
        }

      for (i = 0; i < sample_count; i++)
        {
          ret = ra8e1_get_battery_status(&status);
          if (ret < 0)
            {
              fdemoprintf(stderr, "Sample %d: Failed to read battery status: %d\n", 
                      i + 1, ret);
              continue;
            }

          if (verbose)
            {
              demoprintf("\n--- Sample %d of %d ---\n", i + 1, sample_count);
            }
          else
            {
              demoprintf("%3d:   ", i + 1);
            }

          print_battery_status(&status, verbose);

          if (i < sample_count - 1)
            {
              usleep(delay_ms * 1000);
            }
        }
    }

  demoprintf("\nBattery monitoring complete.\n");
  return EXIT_SUCCESS;

#else
  demoprintf("Error: ADC battery monitoring not enabled in configuration\n");
  demoprintf("Please enable CONFIG_RA_ADC_BATTERY_MONITOR\n");
  return EXIT_FAILURE;
#endif
}

#endif /* CONFIG_RA8E1_ADC_BMS_DEMO */
